{
    "welcomeText": "I am a Junior Web Developer based in the UK. I am experienced with Javascript and React and have a Mechanical Engineering background. I love to learn and my skills, both technical and non-technical are a testament to that (hover over to see - I speak Spanish, I am learning French, I can….). Now with the world seemingly moving into a new age of digital technology I am fully focused on learning about this world and bringing my skills and creativity to it. I have spent lots of the last year and a half reading and listening about AI aswell as developing my website developing skills. I see website development as a great entry-point to the industry as it allows me to develop my knowledge and skills of coding languages whilst also learning about the industry. I have also really enjoyed the mix of technical and creative skills that frontend website development requires.",
    "experienceSummary": "I have made 2 previous websites that include a Javascript and React powered front end as well as servers powered by node.js and express.js which connect with a PostgreSQL database. Both of the websites have been fully deployed via Heroku and have been live and maintained for 6 and 4 months. I found using API’s to be an effective way to achieve complex function within a website without spending lots of resources on coding.",
    "faceRecognitionAppDescription": "This site uses a Clarifai.com API to utilise their AI models to extract 3 pieces of data from images: 1) how many faces are contained within the image? 2) – the colours of the image 3) – a prediction of the subject of the image. This was the first website I made and was a big insight how complex functionality and capability could be added to a website.",
    "frenchVocabAppDescription": "This site is a game for learning French Vocabulary. I made this primarily for my own personal use as I had used a similar game in Spanish and found it to be very effective, but it didn’t exist for French. However, since deploying it I have shown it to a few friends and associates, and they have started using it and found it to be effective for their learning. This brings me great satisfaction that I can help people via websites and is something I want to continue to do, I have plenty of ideas. The website includes some neat features such as saving user progress to a database so they can leave the website and continue from where they left off at a future date. It also uses a Google API to provide audio for the words the user is learning. There are plenty more cool features so I invite you to create an account and try out the website for yourself.",
    "education1": "The last few years I have spent a lot of time self-learning different things from Javascript and React to Spanish to 3D printing to video editing to how to replace parts on my 2003 VW Golf. I am naturally curious and self-learning is something I have grown to love in recent years and is now a huge part of my life. I think this will serve me well in the tech industry which is constantly and rapidly evolving. Below I attach a few relevant things I have learnt recently:",
    "education2": "Keeping up to date with recent AI developments."
  }

  

